---
kind: property
id: P:Autodesk.Revit.DB.Subelement.Category
source: html/0b0c9dba-f5ce-b20d-f883-5ef39bb4a6a5.htm
---
# Autodesk.Revit.DB.Subelement.Category Property

Retrieves a Category object that represents the category or sub category of the subelement.

## Syntax (C#)
```csharp
public Category Category { get; }
```

## Remarks
All category objects can be retrieved from the application by using the Categories property
of the Application.Settings object.